# SetAssociatedLevel Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LevelAssociationData..::..SetAssociatedLevel Method
LevelAssociationData Class See Also
---
Sets the Associated Level.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public void SetAssociatedLevel(
	ElementId levelId
)
```

Visual Basic
---
```text
Public Sub SetAssociatedLevel ( _
	levelId As ElementId _
)
```

Visual C++
---
```text
public:
void SetAssociatedLevel(
	ElementId^ levelId
)
```

# ### Parameters
levelId
    Type: Autodesk.Revit.DB..::..ElementId The id of the Level.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | this operation failed. |

# See Also
LevelAssociationData Class
Autodesk.Revit.DB Namespace